In [1]:
import numpy as np
import pandas as pd

In [18]:
df1 = pd.read_csv('.\Book Examples\pydata-book-2nd-edition\examples/ex1.csv')

In [19]:
df1

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [20]:
pd.read_table('.\Book Examples\pydata-book-2nd-edition\examples/ex1.csv', sep=',')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [22]:
df2 = pd.read_csv('.\Book Examples\pydata-book-2nd-edition\examples\ex2.csv', header=None)

In [23]:
df2

   0   1   2   3      4
0  1   2   3   4  hello
1  5   6   7   8  world
2  9  10  11  12    foo

In [34]:
df[:2]

   1   2   3   4  hello
0  5   6   7   8  world
1  9  10  11  12    foo

In [49]:
df[0:-1]

   1  2  3  4  hello
0  5  6  7  8  world